solvers/icoLagrangianFoam/tut/singleCylinderFilter/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.001 0 0);

boundaryField
{
    
    "(top|bottom|front|back)"
    {
        type            symmetryPlane;
    }
    inlet
    {
       type            fixedValue;    
       value           uniform (0.001 0 0);
    }
    outlet
    {
        type            inletOutlet;//zeroGradient;
	inletValue	uniform (0 0 0);
        value           uniform (0 0 0);
    }
   
    fiber
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
