solvers/icoLagrangianFoam/tut/singleCylinderFilter/0/turb/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.765;

boundaryField
{
    fixedWalls
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.765;
    }
    rotatingWall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.765;
    }
    in
    {
        type            fixedValue;
        value           uniform 0.765;
    }
    out
    {
        type            inletOutlet;
        inletValue      uniform 0.765;
        value           uniform 0.765;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
