solvers/icoLagrangianFoam/tut/singleCylinderFilter/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;//single fiber: fiber diametr=20 micron, SVF=10% >> (square cell=56*56)
		  	 //inlet=20*d_fiber=20*20=400 micron, outlet=5*d_fiber=100 micron
	vertices
	(
		(10 0 -2)//0
		(20 0 -2)//1
		(100 0 -2)//2
		(100 14.142 -2)//3
		(14.142 14.142 -2)//4
		(7.071 7.071 -2)//5
		(100 28 -2)//6
		(14.142 28 -2)//7
		(0 28 -2)//8
		(0 20 -2)//9
		(0 10 -2)//10
		(-10 0 -2)//11
		(-20 0 -2)//12
		(-400 0 -2)//13
		(-400 14.142 -2)//14
		(-14.142 14.142 -2)//15
		(-7.071 7.071 -2)//16
		(-400 28 -2)//17
		(-14.142 28 -2)//18

		(10 0 2)//19
		(20 0 2)//20
		(100 0 2)//21
		(100 14.142 2)//22
		(14.142 14.142 2)//23
		(7.071 7.071 2)//24
		(100 28 2)//25
		(14.142 28 2)//26
		(0 28 2)//27
		(0 20 2)//28
		(0 10 2)//29
		(-10 0 2)//30
		(-20 0 2)//31
		(-400 0 2)//32
		(-400 14.142 2)//33
		(-14.142 14.142 2)//34
		(-7.071 7.071 2)//35
		(-400 28 2)//36
		(-14.142 28 2)//37

		(100 -14.142 -2)//38
		(14.142 -14.142 -2)//39
		(7.071 -7.071 -2)//40
		(100 -28 -2)//41
		(14.142 -28 -2)//42
		(0 -28 -2)//43
		(0 -20 -2)//44
		(0 -10 -2)//45
		(-400 -14.142 -2)//46
		(-14.142 -14.142 -2)//47
		(-7.071 -7.071 -2)//48
		(-400 -28 -2)//49
		(-14.142 -28 -2)//50

		(100 -14.142 2)//51
		(14.142 -14.142 2)//52
		(7.071 -7.071 2)//53
		(100 -28 2)//54
		(14.142 -28 2)//55
		(0 -28 2)//56
		(0 -20 2)//57
		(0 -10 2)//58
		(-400 -14.142 2)//58
		(-14.142 -14.142 2)//60
		(-7.071 -7.071 2)//61
		(-400 -28 2)//62
		(-14.142 -28 2)//63
	);
	blocks
	(
		hex (5 4 9 10 24 23 28 29) (3 2 2) simpleGrading (5 1 1)//vertex,numbers of cells in each direction,cell expansion ratios
		hex (0 1 4 5 19 20 23 24) (3 2 2) simpleGrading (5 1 1)
		hex (1 2 3 4 20 21 22 23) (20 2 2) simpleGrading (1 1 1)
		hex (4 3 6 7 23 22 25 26) (20 4 2) simpleGrading (1 1 1)
		hex (9 4 7 8 28 23 26 27) (2 4 2) simpleGrading (1 1 1)
		hex (16 10 9 15 35 29 28 34) (2 3 2) simpleGrading (1 5 1)
		hex (11 16 15 12 30 35 34 31) (2 3 2) simpleGrading (1 5 1)
		hex (12 15 14 13 31 34 33 32) (2 80 2) simpleGrading (1 1 1)
		hex (15 18 17 14 34 37 36 33) (4 80 2) simpleGrading (1 1 1)
		hex (9 8 18 15 28 27 37 34) (4 2 2) simpleGrading (1 1 1)

		hex (40 45 44 39 53 58 57 52) (2 3 2) simpleGrading (1 5 1)
		hex (0 40 39 1 19 53 52 20) (2 3 2) simpleGrading (1 5 1)
		hex (1 39 38 2 20 52 51 21) (2 20 2) simpleGrading (1 1 1)
		hex (39 42 41 38 52 55 54 51) (4 20 2) simpleGrading (1 1 1)
		hex (44 43 42 39 57 56 55 52) (4 2 2) simpleGrading (1 1 1)
		hex (48 47 44 45 61 60 57 58) (3 2 2) simpleGrading (5 1 1)
		hex (11 12 47 48 30 31 60 61) (3 2 2) simpleGrading (5 1 1)
		hex (12 13 46 47 31 32 59 60) (80 2 2) simpleGrading (1 1 1)
		hex (47 46 49 50 60 59 62 63) (80 4 2) simpleGrading (1 1 1)
		hex (44 47 50 43 57 60 63 56) (2 4 2) simpleGrading (1 1 1)
	);
	edges
	(
		arc 0 5 (9.3969 3.4202 -2)
		arc 5 10 (3.4202 9.3969 -2)
		arc 1 4 (18.79386 6.8404 -2)
		arc 4 9 (6.8404 18.79386 -2)
		arc 19 24 (9.3969 3.4202 2)
		arc 24 29 (3.4202 9.3969 2)
		arc 20 23 (18.79386 6.8404 2)
		arc 23 28 (6.8404 18.79386 2)
		arc 11 16 (-9.3969 3.4202 -2)
		arc 16 10 (-3.4202 9.3969 -2)
		arc 12 15 (-18.79386 6.8404 -2)
		arc 15 9 (-6.8404 18.79386 -2)
		arc 30 35 (-9.3969 3.4202 2)
		arc 35 29 (-3.4202 9.3969 2)
		arc 31 34 (-18.79386 6.8404 2)
		arc 34 28 (-6.8404 18.79386 2)
		arc 0 40 (9.3969 -3.4202 -2)
		arc 40 45 (3.4202 -9.3969 -2)
		arc 1 39 (18.79386 -6.8404 -2)
		arc 39 44 (6.8404 -18.79386 -2)
		arc 19 53 (9.3969 -3.4202 2)
		arc 53 58 (3.4202 -9.3969 2)
		arc 20 52 (18.79386 -6.8404 2)
		arc 52 57 (6.8404 -18.79386 2)
		arc 11 48 (-9.3969 -3.4202 -2)
		arc 48 45 (-3.4202 -9.3969 -2)
		arc 12 47 (-18.79386 -6.8404 -2)
		arc 47 44 (-6.8404 -18.79386 -2)
		arc 30 61 (-9.3969 -3.4202 2)
		arc 61 58 (-3.4202 -9.3969 2)
		arc 31 60 (-18.79386 -6.8404 2)
		arc 60 57 (-6.8404 -18.79386 2)

	);
	boundary
	(
		top
		{
		type symmetryPlane;
		faces
			(
			(7 8 27 26)
			(6 7 26 25)
			(8 18 37 27)
			(18 17 36 37)
			);
		}
		bottom
		{
		type symmetryPlane;
		faces
			(
			(49 50 63 62)
			(50 43 56 63)
			(43 42 55 56)
			(42 41 54 55)
			);
		}
		inlet
		{
		type patch;
		faces
			(
			(14 13 32 33)
			(17 14 33 36)
			(46 13 32 59)
			(46 49 62 59)
			);
		}
		outlet
		{
		type patch;
		faces
			(
			(2 3 22 21)
			(3 6 25 22)
			(38 51 21 2)
			(41 54 51 38)
			);
		}
		fiber
		{
		type wall;
		faces
			(
			(10 5 24 29)
			(5 0 19 24)
			(16 10 29 35)
			(11 16 35 30)
			(48 11 30 61)
			(45 48 61 58)
			(40 45 58 53)
			(0 40 53 19)
			);
		}
		front
		{
		type symmetryPlane;
		faces
			(
			(24 23 28 29)
			(19 20 23 24)
			(20 21 22 23)
			(23 22 25 26)
			(28 23 26 27)
			(35 29 28 34)
			(31 30 35 34)
			(32 31 34 33)
			(33 34 37 36)
			(34 28 27 37)
			(58 57 52 53)
			(53 52 20 19)
			(52 51 21 20)
			(52 55 54 51)
			(57 56 55 52)
			(60 57 58 61)
			(31 60 61 30)
			(32 59 60 31)
			(62 63 60 59)
			(63 56 57 60)
			);
		}
		back
		{
		type symmetryPlane;
		faces
			(
			(5 10 9 4)
			(0 5 4 1)
			(1 4 3 2)
			(4 7 6 3)
			(4 9 8 7)
			(16 15 9 10)
			(12 15 16 11)
			(13 14 15 12)
			(14 17 18 15)
			(15 18 8 9)
			(45 40 39 44)
			(40 0 1 39)
			(39 1 2 38)
			(39 38 41 42)
			(44 39 42 43)
			(47 48 45 44)
			(12 11 48 47)
			(13 12 47 46)
			(49 46 47 50)
			(50 47 44 43)
			);
		}
	);
	mergePatchPairs
	(
	);

// ************************************************************************* //
